"""
第一节 字符串的格式化输出
·传统格式化输出的方法：%
%d:为数据类型占位
%s:为字符占位
%f:为浮点数占位
·f表达式
"""
s1 = "%s,臣服于我！"%("画笔")
print(s1)
s2 = "只要有芽衣在，就有%d个人的力量了"%(100) # 为整数占位，自动去掉小数
print(s2)
s3 = "只要有芽衣在，就有%f的力量了"%(100) # 为浮点数占位，保留小数
print(s3)
s4 = "只要有芽衣在，就有%.3f的力量了"%(100) # 用.阿拉伯数字确定保留位数
print(s4)
# 2·f表达式
name = "少女"
age = "18"
s5 = f"嗨呀！艾莉西雅永远是{age}的{name}"
print(s5)
s6 = "嗨呀！艾莉西雅永远是{}的{}" .format(age,name)
print(s6)
print("=================分界线=====================")
"""
第二节 进阶
"""
# 1·字符串的长度（len）
print(len(s1))# 显示字符串长度（空格算字符哦）
# 2·format的进阶使用
from math import *
print("众所周知，圆周率为{}".format(pi))
print("众所周知，圆周率为{:.2f}".format(pi))# format的四舍五入
print("众所周知，圆周率为{0:.2f}".format(pi,e))
print("众所周知，自然底数为{1:.2f}".format(pi,e))
print("众所周知，自然底数为{1}".format(pi,e))
"""
对于format函数，小括号内的下标同样从0开始
当需要保留小数时可用:.f
当需要保留百分数可用:.%
"""
s7 = "源神中有{:.1%}的男角色"
print(s7.format(7328E-4))
