"""
第一节 字符串 放在”“/''/""" """内
"""
n="为世间的一切美好而战"
print(n[1:3])#取前不取后，不填默认为“最前”和“最后”
print(n[:])
print(n[-4:-2])#-指从后往前取值
"""
切片格式 [start:end:steep]
"""
print("============分割线=============")
print(n[::2])#步长隔n-1步
print(n[0:7:3])
print(n[-8:-0:2])
"""
注意：前小于后
注意：空格也是字符
"""
print("=============分割线==============")
"""
第二节 字符串的索引/下标：由0起位
"""
print(n[2])#输出下标为2的字符
"""
第三节 字符串的拼接
"""
a="这世间"
b="从来都不美好"
print(a+b)
c="回应我吧！"
d="艾莉西雅"
print(c,d)
f=','.join((c,d))#把,作为两段文字的分隔符
print(f)
print(",".join((a,b)))
print("============分割线==============")
"""
第四节 字符串的格式化
"""
answer="{}你找到{}了".format("舰长","希儿")#扣字
print(answer)
answer2="{}是个{}呢，摸摸头"
print(answer2.format("你","乖孩子"))
print("============分割线==============")
